/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   parse_util.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jungtlee <jungtlee@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/09 21:18:44 by jungtlee          #+#    #+#             */
/*   Updated: 2020/02/09 21:19:26 by jungtlee         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "rush_header.h"

// : 939 이런거 처리하기 위함
int		col_check(char *str, int flag)
{
	int cnt;

	// :이게 맨 처음에 나오면
	if (flag == 0)
		return (1);
	
	cnt = 0;
	// str이 빈칸이거나 숫자일때
	while (*str == ' ' || (*str >= '0' && *str <= '9'))
	{
		// 계속 증가
		str++;
		// cnt도 증가
		cnt++;
	}
	// :가 있는 위치보다 숫자가 뒤에 있을 때
	if (flag <= cnt)
		return (0);

	return (1);
}
